БПКР/src/DataProcessors/ПечатьПараметровУчета/ПечатьПараметровУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПечатьПараметровУчета</name>
</mdclass:DataProcessor>

БПКР/src/InformationRegisters/УчетнаяПолитикаОрганизаций/УчетнаяПолитикаОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетнаяПолитикаОрганизаций</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>ПлательщикНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПлательщикНСП</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПлательщикНП</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПлательщикНИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПлательщикЗН</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПлательщикЕН</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчетНДСНаАвансы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УказыватьПризнакЗачетаНДСПриПоступлении</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтавкаНСПДляРасчетаНДСНаАвансы</name>
    <type>
      <types>CatalogRef.СтавкиНСП</types>
    </type>
  </resources>
  <resources>
    <name>СтавкаНалогаНаПрибыль</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПороговыйПроцентОсвобожденныхПоставок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НачислениеАмортизацииОСПоМесяцам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособОценкиТМЗ</name>
    <type>
      <types>EnumRef.СпособыОценки</types>
    </type>
  </resources>
  <resources>
    <name>ВидУчетаИзносаМБП</name>
    <type>
      <types>EnumRef.ВидыУчетаИзносаМБП</types>
    </type>
  </resources>
  <resources>
    <name>СтавкаНСПРеализацииТовары</name>
    <type>
      <types>CatalogRef.СтавкиНСП</types>
    </type>
  </resources>
  <resources>
    <name>СтавкаНСПРеализацииУслуги</name>
    <type>
      <types>CatalogRef.СтавкиНСП</types>
    </type>
  </resources>
  <resources>
    <name>СтавкаТаможенногоСбора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Контракт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтавкаЕННаличнаяФорма1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтавкаЕННаличнаяФорма2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтавкаЕНБезНаличнаяФорма1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтавкаЕНБезНаличнаяФорма2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПлательщикЕНКассовыйМетод</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПлательщикЕНМетодНачисления</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьЗакупкиБезНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МинимумСтоимостиОСДляНУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтчетПоНДСПоПоставке</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаЗН</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетРасходовЗН</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>КоэффициентИнфляции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НеПлательщикНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БПКР/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>DefinedType.КурсВалюты</types>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БПКР/src/InformationRegisters/МетодыРаспределенияКосвенныхРасходовОрганизаций/МетодыРаспределенияКосвенныхРасходовОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МетодыРаспределенияКосвенныхРасходовОрганизаций</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>БазаРаспределения</name>
    <type>
      <types>EnumRef.БазыРаспределенияКосвенныхРасходов</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БПКР/src/InformationRegisters/УчетнаяПолитикаПоПерсоналу/УчетнаяПолитикаПоПерсоналу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетнаяПолитикаПоПерсоналу</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>ВидТарифовСтраховыхВзносов</name>
    <type>
      <types>EnumRef.ВидыТарифовСтраховыхВзносов</types>
    </type>
  </resources>
  <resources>
    <name>ПределыПоПодразделениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВозвратОтрицательнойСуммой</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОграниченияНачисленияГНПФМужчины</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОграниченияНачисленияГНПФЖенщины</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>МинимальныйРасчетныйДоход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоплатаПНЗаСчетФирмы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаРасходовПоДоплатеПН</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяПоДоплатеПН</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаРасчетовПФФ</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаРасчетовМСФ</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаРасчетовФОТФ</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаРасчетовПФР</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаРасчетовГНПФР</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СреднемесячнаяЗПСФ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтСЗПСФ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаРасходовПоКорректировкеСФ</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяПоКорректировкеСФ</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоСотрудниковДляОтчетаСФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтавкаПрофВзнос</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаРасчетовПрофВзнос</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>ПрофВзносЗаВычетомПН</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПрофВзносЗаВычетомПФРиГНПФР</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидУдержанияПоПрофВзнос</name>
    <type>
      <types>ChartOfCalculationTypesRef.ВидыУдержаний</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаШтрафыПениНеустойкиСФ</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаПоПНДляПрочихФизическихЛиц</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>РасчетПНБезНакопления</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БПКР/src/InformationRegisters/ПределыПоПодразделениям/ПределыПоПодразделениям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПределыПоПодразделениям</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>МинимальныйРасчетныйДоход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СреднемесячнаяЗПСФ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтделениеСФ</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>УГНС</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БПКР/src/DataProcessors/ПечатьПараметровУчета/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьТабличныйДокумент();	
	
	ПоказыватьПриОткрытииПрограммы = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПечатьПараметровУчета", "Показывать", Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоказыватьПриОткрытииПрограммыПриИзменении(Элемент)
	СохранитьНастройкиПоказыватьПриОткрытииПрограммы(ПоказыватьПриОткрытииПрограммы);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	
	ЗаполнитьТабличныйДокумент();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТабличныйДокумент()

	Макет = Обработки.ПечатьПараметровУчета.ПолучитьМакет("Макет");	

	// Подготовка областей и структуры заполнения.
	ОбластьРаздел 						= Макет.ПолучитьОбласть("ОбластьРаздел");
	ОбластьПодраздел 					= Макет.ПолучитьОбласть("ОбластьПодраздел");
	ОбластьНастройкаБулевоПустая 		= Макет.ПолучитьОбласть("ОбластьНастройкаБулевоПустая");
	ОбластьНастройкаБулевоЗаполненная 	= Макет.ПолучитьОбласть("ОбластьНастройкаБулевоЗаполненная");
	ОбластьНастройкаПроизвольногоТипа 	= Макет.ПолучитьОбласть("ОбластьНастройкаПроизвольногоТипа");
	ПустаяОбласть						= Макет.ПолучитьОбласть("ПустаяОбласть");
	
	ДанныеПечати = Новый Структура();
	ДанныеПечати.Вставить("НаименованиеРаздела", 	"");
	ДанныеПечати.Вставить("НаименованиеПодраздела", "");
	ДанныеПечати.Вставить("НаименованиеНастройки", 	"");
	
	// Раздел "Организации".
	ЗаполнитьИВывестиОбластьМакета(ОбластьРаздел, ДанныеПечати, "НаименованиеРаздела", 
									НСтр("ru = 'Организации'"), ТабличныйДокумент); 
	
	ЗаполнитьИВывестиОбластьМакета(
		?(Константы.ФункциональнаяОпцияУчетПоНесколькимОрганизациям.Получить(), ОбластьНастройкаБулевоЗаполненная, ОбластьНастройкаБулевоПустая), 
		ДанныеПечати, "НаименованиеНастройки", НСтр("ru = 'Вести учет в информационной базе по нескольким организациям'"), ТабличныйДокумент);	
	
	ОсновнаяОрганизация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Организации.Код КАК Код,
		|	Организации.Наименование КАК Наименование,
		|	Организации.Префикс КАК Префикс,
		|	Организации.НаименованиеПолное КАК НаименованиеПолное,
		|	Организации.ИНН КАК ИНН,
		|	Организации.ОсновнойБанковскийСчет КАК ОсновнойБанковскийСчет,
		|	Организации.ОсновнаяКасса КАК ОсновнаяКасса,
		|	Организации.КодПоОКПО КАК КодПоОКПО,
		|	Организации.ГНС КАК ГНС,
		|	Организации.КонтрагентГНС КАК КонтрагентГНС,
		|	Организации.РегНомерСоцФонда КАК РегНомерСоцФонда,
		|	Организации.КодГКЭД КАК КодГКЭД,
		|	Организации.НаименованиеГКЭД КАК НаименованиеГКЭД,
		|	Организации.ОрганУправления КАК ОрганУправления,
		|	Организации.КодПравовойФормы КАК КодПравовойФормы,
		|	Организации.ДатаРегистрации КАК ДатаРегистрации,
		|	Организации.ДатаРегистрацииНДС КАК ДатаРегистрацииНДС,
		|	Организации.НомерДокументаРегистрацииНДС КАК НомерДокументаРегистрацииНДС,
		|	Организации.СерияДокументаРегистрацииНДС КАК СерияДокументаРегистрацииНДС,
		|	Организации.СОАТО КАК СОАТО
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.Ссылка = &Ссылка";	
	Запрос.УстановитьПараметр("Ссылка", ОсновнаяОрганизация);	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент.Вывести(ПустаяОбласть);
	ЗаполнитьИВывестиОбластьМакета(ОбластьПодраздел, ДанныеПечати, "НаименованиеПодраздела", 
									НСтр("ru = 'Справочник ""Организации""'"), ТабличныйДокумент);										
									
	Если Выборка.Следующий() Тогда	
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Код: %1'"), Выборка.Код), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Наименование: %1'"), Выборка.Наименование), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Префикс: %1'"), Выборка.Префикс), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Полное наименование: %1'"), Выборка.НаименованиеПолное), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'ИНН: %1'"), Выборка.ИНН), ТабличныйДокумент);	
		
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Основной банковский счет: %1'"), Выборка.ОсновнойБанковскийСчет), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Основная касса: %1'"), Выборка.ОсновнаяКасса), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'ОКПО: %1'"), Выборка.КодПоОКПО), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'ГНС: %1'"), Выборка.ГНС), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Контрагент ГНС: %1'"), Выборка.КонтрагентГНС), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Рег. № СФ: %1'"), Выборка.РегНомерСоцФонда), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Код осн. вида деят-ти по ГКЭД: %1'"), Выборка.КодГКЭД), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Наим. осн. вида деят-ти по ГКЭД: %1'"), Выборка.НаименованиеГКЭД), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Орган управления: %1'"), Выборка.ОрганУправления), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'ОПФ: %1'"), Выборка.КодПравовойФормы), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Дата регистрации: %1'"), Формат(Выборка.ДатаРегистрации, "ДЛФ=D")), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Дата регистрации НДС: %1'"), Формат(Выборка.ДатаРегистрацииНДС, "ДЛФ=D")), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Номер документа регистрации НДС: %1'"), Выборка.НомерДокументаРегистрацииНДС), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Серия документа регистрации НДС: %1'"), Выборка.СерияДокументаРегистрацииНДС), ТабличныйДокумент);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодразделенияОрганизаций.Код КАК Код,
		|	ПодразделенияОрганизаций.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций";	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент.Вывести(ПустаяОбласть);
	ЗаполнитьИВывестиОбластьМакета(ОбластьПодраздел, ДанныеПечати, "НаименованиеПодраздела", 
									НСтр("ru = 'Справочник ""Подразделения""'"), ТабличныйДокумент);
									
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыПодразделения");									
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	Пока Выборка.Следующий() Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаблицыПодразделения");
		ОбластьМакета.Параметры.Заполнить(Выборка);
		ТабличныйДокумент.Вывести(ОбластьМакета);										
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчетнаяПолитикаОрганизацийСрезПоследних.Период КАК Период,
		|	УчетнаяПолитикаОрганизацийСрезПоследних.Организация КАК Организация,
		|	УчетнаяПолитикаОрганизацийСрезПоследних.ПлательщикНДС КАК ПлательщикНДС,
		|	УчетнаяПолитикаОрганизацийСрезПоследних.ПлательщикНСП КАК ПлательщикНСП,
		|	УчетнаяПолитикаОрганизацийСрезПоследних.ПлательщикНП КАК ПлательщикНП,
		|	УчетнаяПолитикаОрганизацийСрезПоследних.ПлательщикНИ КАК ПлательщикНИ,
		|	УчетнаяПолитикаОрганизацийСрезПоследних.ПлательщикЕН КАК ПлательщикЕН,
		|	УчетнаяПолитикаОрганизацийСрезПоследних.УчетНДСНаАвансы КАК УчетНДСНаАвансы,
		|	УчетнаяПолитикаОрганизацийСрезПоследних.УказыватьПризнакЗачетаНДСПриПоступлении КАК УказыватьПризнакЗачетаНДСПриПоступлении,
		|	УчетнаяПолитикаОрганизацийСрезПоследних.СтавкаНСПДляРасчетаНДСНаАвансы КАК СтавкаНСПДляРасчетаНДСНаАвансы,
		|	УчетнаяПолитикаОрганизацийСрезПоследних.СтавкаНалогаНаПрибыль КАК СтавкаНалогаНаПрибыль,
		|	УчетнаяПолитикаОрганизацийСрезПоследних.ПороговыйПроцентОсвобожденныхПоставок КАК ПороговыйПроцентОсвобожденныхПоставок,
		|	УчетнаяПолитикаОрганизацийСрезПоследних.НачислениеАмортизацииОСПоМесяцам КАК НачислениеАмортизацииОСПоМесяцам,
		|	УчетнаяПолитикаОрганизацийСрезПоследних.СпособОценкиТМЗ КАК СпособОценкиТМЗ,
		|	УчетнаяПолитикаОрганизацийСрезПоследних.ВидУчетаИзносаМБП КАК ВидУчетаИзносаМБП,
		|	УчетнаяПолитикаОрганизацийСрезПоследних.СтавкаНСПРеализацииТовары КАК СтавкаНСПРеализацииТовары,
		|	УчетнаяПолитикаОрганизацийСрезПоследних.СтавкаНСПРеализацииУслуги КАК СтавкаНСПРеализацииУслуги,
		|	УчетнаяПолитикаОрганизацийСрезПоследних.СтавкаТаможенногоСбора КАК СтавкаТаможенногоСбора,
		|	УчетнаяПолитикаОрганизацийСрезПоследних.Контракт КАК Контракт,
		|	УчетнаяПолитикаОрганизацийСрезПоследних.СтавкаЕННаличнаяФорма1 КАК СтавкаЕННаличнаяФорма1,
		|	УчетнаяПолитикаОрганизацийСрезПоследних.СтавкаЕННаличнаяФорма2 КАК СтавкаЕННаличнаяФорма2,
		|	УчетнаяПолитикаОрганизацийСрезПоследних.СтавкаЕНБезНаличнаяФорма1 КАК СтавкаЕНБезНаличнаяФорма1,
		|	УчетнаяПолитикаОрганизацийСрезПоследних.СтавкаЕНБезНаличнаяФорма2 КАК СтавкаЕНБезНаличнаяФорма2,
		|	УчетнаяПолитикаОрганизацийСрезПоследних.НеУчитыватьЗакупкиБезНДС КАК НеУчитыватьЗакупкиБезНДС,
		|	УчетнаяПолитикаОрганизацийСрезПоследних.МинимумСтоимостиОСДляНУ КАК МинимумСтоимостиОСДляНУ
		|ИЗ
		|	РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(, Организация = &Организация) КАК УчетнаяПолитикаОрганизацийСрезПоследних";	
	Запрос.УстановитьПараметр("Организация", ОсновнаяОрганизация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент.Вывести(ПустаяОбласть);
	ЗаполнитьИВывестиОбластьМакета(ОбластьПодраздел, ДанныеПечати, "НаименованиеПодраздела", 
									НСтр("ru = 'Учетная политика'"), ТабличныйДокумент);
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Период: %1'"), Формат(Выборка.Период, "ДЛФ=D")), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Организация: %1'"), Выборка.Организация), ТабличныйДокумент);	
						
		ЗаполнитьИВывестиОбластьМакета(?(Выборка.ПлательщикНДС, ОбластьНастройкаБулевоЗаполненная, ОбластьНастройкаБулевоПустая), ДанныеПечати, 
			"НаименованиеНастройки", НСтр("ru = 'Плательщик НДС'"), ТабличныйДокумент);
		
		ЗаполнитьИВывестиОбластьМакета(?(Выборка.ПлательщикНСП, ОбластьНастройкаБулевоЗаполненная, ОбластьНастройкаБулевоПустая), ДанныеПечати, 
			"НаименованиеНастройки", НСтр("ru = 'Плательщик НСП'"), ТабличныйДокумент);
		
		ЗаполнитьИВывестиОбластьМакета(?(Выборка.ПлательщикНП, ОбластьНастройкаБулевоЗаполненная, ОбластьНастройкаБулевоПустая), ДанныеПечати, 
			"НаименованиеНастройки", НСтр("ru = 'Плательщик НП'"), ТабличныйДокумент);
		
		ЗаполнитьИВывестиОбластьМакета(?(Выборка.ПлательщикНИ, ОбластьНастройкаБулевоЗаполненная, ОбластьНастройкаБулевоПустая), ДанныеПечати, 
			"НаименованиеНастройки", НСтр("ru = 'Плательщик НИ'"), ТабличныйДокумент);
		
		ЗаполнитьИВывестиОбластьМакета(?(Выборка.ПлательщикЕН, ОбластьНастройкаБулевоЗаполненная, ОбластьНастройкаБулевоПустая), ДанныеПечати, 
			"НаименованиеНастройки", НСтр("ru = 'Плательщик ЕН'"), ТабличныйДокумент);
		
		ЗаполнитьИВывестиОбластьМакета(?(Выборка.УчетНДСНаАвансы, ОбластьНастройкаБулевоЗаполненная, ОбластьНастройкаБулевоПустая), ДанныеПечати, 
			"НаименованиеНастройки", НСтр("ru = 'Указывать признак зачета НДС'"), ТабличныйДокумент);
		
		ЗаполнитьИВывестиОбластьМакета(?(Выборка.УказыватьПризнакЗачетаНДСПриПоступлении, ОбластьНастройкаБулевоЗаполненная, ОбластьНастройкаБулевоПустая), ДанныеПечати, 
			"НаименованиеНастройки", НСтр("ru = 'Не учитывать закупки без НДС'"), ТабличныйДокумент);
		
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Ставка НСП для расчета НДС на авансы: %1'"), Выборка.СтавкаНСПДляРасчетаНДСНаАвансы), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Ставка налога на прибыль: %1'"), Выборка.СтавкаНалогаНаПрибыль), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Пороговый %1 освобожденных поставок: %2'"), "%", Выборка.ПороговыйПроцентОсвобожденныхПоставок), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(?(Выборка.НачислениеАмортизацииОСПоМесяцам, ОбластьНастройкаБулевоЗаполненная, ОбластьНастройкаБулевоПустая), ДанныеПечати, 
			"НаименованиеНастройки", НСтр("ru = 'Начисление амортизации ОС по месяцам'"), ТабличныйДокумент);
		
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Способ оценки ТМЗ: %1'"), Выборка.СпособОценкиТМЗ), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Вид учета износа МБП: %1'"), Выборка.ВидУчетаИзносаМБП), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Ставка НСП для реализации (закладка ""Товары""): %1'"), Выборка.СтавкаНСПРеализацииТовары), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Ставка НСП для реализации (закладка ""Услуги""): %1'"), Выборка.СтавкаНСПРеализацииУслуги), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Ставка таможенного сбора: %1'"), Выборка.СтавкаТаможенногоСбора), ТабличныйДокумент);
		
		ЗаполнитьИВывестиОбластьМакета(?(Выборка.Контракт, ОбластьНастройкаБулевоЗаполненная, ОбластьНастройкаБулевоПустая), ДанныеПечати, 
			"НаименованиеНастройки", НСтр("ru = 'Контракт'"), ТабличныйДокумент);
		
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Ставка (наличная форма) (вид деятельности ""Переработка, производство, торговля""): %1'"), Выборка.СтавкаЕННаличнаяФорма1), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Ставка (безналичная форма) (вид деятельности ""Переработка, производство, торговля""): %1'"), Выборка.СтавкаЕНБезНаличнаяФорма1), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Ставка (наличная форма) (вид деятельности ""Прочее""): %1'"), Выборка.СтавкаЕННаличнаяФорма2), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Ставка (безналичная форма) (вид деятельности ""Прочее""): %1'"), Выборка.СтавкаЕНБезНаличнаяФорма2), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(?(Выборка.НеУчитыватьЗакупкиБезНДС, ОбластьНастройкаБулевоЗаполненная, ОбластьНастройкаБулевоПустая), ДанныеПечати, 
			"НаименованиеНастройки", НСтр("ru = 'Не учитывать закупки без НДС'"), ТабличныйДокумент);
		
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Минимум стоимости ОС для НУ: %1'"), Выборка.МинимумСтоимостиОСДляНУ), ТабличныйДокумент);	
	КонецЕсли;
	// КОНЕЦ Раздел "Организации".
	
	ТабличныйДокумент.Вывести(ПустаяОбласть);
	
	// Раздел "Валютный учет".
	ЗаполнитьИВывестиОбластьМакета(ОбластьРаздел, ДанныеПечати, "НаименованиеРаздела", 
									НСтр("ru = 'Валютный учет'"), ТабличныйДокумент);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Валюты.НаименованиеПолное КАК НаименованиеВалюты,
		|	Валюты.Код КАК ЦифровойКод,
		|	Валюты.Наименование КАК СимвольныйКод,
		|	КурсыВалютСрезПоследних.Курс КАК Курс,
		|	КурсыВалютСрезПоследних.Кратность КАК Кратность
		|ИЗ
		|	Справочник.Валюты КАК Валюты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних КАК КурсыВалютСрезПоследних
		|		ПО Валюты.Ссылка = КурсыВалютСрезПоследних.Валюта";
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЗаполнитьИВывестиОбластьМакета(ОбластьПодраздел, ДанныеПечати, "НаименованиеПодраздела", 
									НСтр("ru = 'Справочник ""Валюты""'"), ТабличныйДокумент);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыВалюты");									
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	Пока Выборка.Следующий() Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаблицыВалюты");
		ОбластьМакета.Параметры.Заполнить(Выборка);
		ТабличныйДокумент.Вывести(ОбластьМакета);										
	КонецЦикла;
	
	ТабличныйДокумент.Вывести(ПустаяОбласть);
	
	ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
		СтрШаблон(НСтр("ru = 'Валюта регламентированного учета: %1'"), Константы.ВалютаРегламентированногоУчета.Получить()), ТабличныйДокумент);
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МетодыРаспределенияКосвенныхРасходовОрганизаций.Период КАК Период,
		|	МетодыРаспределенияКосвенныхРасходовОрганизаций.Организация КАК Организация,
		|	МетодыРаспределенияКосвенныхРасходовОрганизаций.СчетЗатрат КАК СчетЗатрат,
		|	МетодыРаспределенияКосвенныхРасходовОрганизаций.Подразделение КАК Подразделение,
		|	МетодыРаспределенияКосвенныхРасходовОрганизаций.БазаРаспределения КАК БазаРаспределения
		|ИЗ
		|	РегистрСведений.МетодыРаспределенияКосвенныхРасходовОрганизаций КАК МетодыРаспределенияКосвенныхРасходовОрганизаций";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() <> 0 Тогда
		ТабличныйДокумент.Вывести(ПустаяОбласть);
		ЗаполнитьИВывестиОбластьМакета(ОбластьПодраздел, ДанныеПечати, "НаименованиеПодраздела", 
										НСтр("ru = 'Настройка счетов учета с особым порядком переоценки'"), ТабличныйДокумент);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыПереоценка");									
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		Пока Выборка.Следующий() Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаблицыПереоценка");
			ОбластьМакета.Параметры.Заполнить(Выборка);
			ТабличныйДокумент.Вывести(ОбластьМакета);	
		КонецЦикла;
	КонецЕсли;
	// КОНЕЦ Раздел "Валютный учет".
	
	ТабличныйДокумент.Вывести(ПустаяОбласть);
	
	// Раздел "Денежные средства".
	ЗаполнитьИВывестиОбластьМакета(ОбластьРаздел, ДанныеПечати, "НаименованиеРаздела", 
									НСтр("ru = 'Денежные средства'"), ТабличныйДокумент);
	
	ЗаполнитьИВывестиОбластьМакета(
		?(Константы.ИспользоватьСтатьиДвиженияДенежныхСредств.Получить(), ОбластьНастройкаБулевоЗаполненная, ОбластьНастройкаБулевоПустая), 
		ДанныеПечати, "НаименованиеНастройки", НСтр("ru = 'Настройка учета по статьям движения денежных средств'"), ТабличныйДокумент);
	// КОНЕЦ Раздел "Денежные средства".
	
	ТабличныйДокумент.Вывести(ПустаяОбласть);
	
	// Раздел "Основные средства".
	ЗаполнитьИВывестиОбластьМакета(ОбластьРаздел, ДанныеПечати, "НаименованиеРаздела", 
									НСтр("ru = 'Основные средства'"), ТабличныйДокумент);
	
	ЗаполнитьИВывестиОбластьМакета(
		?(Константы.ФункциональнаяОпцияУчетДвиженияОСПоПодразделениям.Получить(), ОбластьНастройкаБулевоЗаполненная, ОбластьНастройкаБулевоПустая), 
		ДанныеПечати, "НаименованиеНастройки", НСтр("ru = 'Учет движения ОС по подразделениям'"), ТабличныйДокумент);
		
	ЗаполнитьИВывестиОбластьМакета(
		?(Константы.ФункциональнаяОпцияУчетДвиженияОСПоМОЛ.Получить(), ОбластьНастройкаБулевоЗаполненная, ОбластьНастройкаБулевоПустая), 
		ДанныеПечати, "НаименованиеНастройки", НСтр("ru = 'Учет движения ОС по МОЛ'"), ТабличныйДокумент);
		
	ЗаполнитьИВывестиОбластьМакета(
		?(Константы.ФункциональнаяОпцияВестиУчетОСПоКомплектам.Получить(), ОбластьНастройкаБулевоЗаполненная, ОбластьНастройкаБулевоПустая), 
		ДанныеПечати, "НаименованиеНастройки", НСтр("ru = 'Вести учет ОС по комплектам'"), ТабличныйДокумент);
		
	ЗаполнитьИВывестиОбластьМакета(
		?(Константы.ВычетНАПриМодернизации.Получить(), ОбластьНастройкаБулевоЗаполненная, ОбластьНастройкаБулевоПустая), 
		ДанныеПечати, "НаименованиеНастройки", НСтр("ru = 'Вычет НА при модернизации'"), ТабличныйДокумент);
	// КОНЕЦ Раздел "Основные средства".
	
	ТабличныйДокумент.Вывести(ПустаяОбласть);
	
	// Раздел "Зарплата и персонал".
	ЗаполнитьИВывестиОбластьМакета(ОбластьРаздел, ДанныеПечати, "НаименованиеРаздела", 
									НСтр("ru = 'Зарплата и персонал'"), ТабличныйДокумент);
									
	ЗаполнитьИВывестиОбластьМакета(
		?(Константы.ФункциональнаяОпцияУчетЗаработнойПлатыВВалюте.Получить(), ОбластьНастройкаБулевоЗаполненная, ОбластьНастройкаБулевоПустая), 
		ДанныеПечати, "НаименованиеНастройки", НСтр("ru = 'Учет заработной платы в валюте'"), ТабличныйДокумент);
		
	ЗаполнитьИВывестиОбластьМакета(
		?(Константы.ФункциональнаяОпцияВестиШтатноеРасписание.Получить(), ОбластьНастройкаБулевоЗаполненная, ОбластьНастройкаБулевоПустая), 
		ДанныеПечати, "НаименованиеНастройки", НСтр("ru = 'Вести штатное расписание'"), ТабличныйДокумент);									
		
	ТабличныйДокумент.Вывести(ПустаяОбласть);	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчетнаяПолитикаПоПерсоналуСрезПоследних.Период КАК Период,
		|	УчетнаяПолитикаПоПерсоналуСрезПоследних.Организация КАК Организация,
		|	УчетнаяПолитикаПоПерсоналуСрезПоследних.ПределыПоПодразделениям КАК ПределыПоПодразделениям,
		|	УчетнаяПолитикаПоПерсоналуСрезПоследних.ВозвратОтрицательнойСуммой КАК ВозвратОтрицательнойСуммой,
		|	УчетнаяПолитикаПоПерсоналуСрезПоследних.ДатаОграниченияНачисленияГНПФМужчины КАК ДатаОграниченияНачисленияГНПФМужчины,
		|	УчетнаяПолитикаПоПерсоналуСрезПоследних.ДатаОграниченияНачисленияГНПФЖенщины КАК ДатаОграниченияНачисленияГНПФЖенщины,
		|	УчетнаяПолитикаПоПерсоналуСрезПоследних.МинимальныйРасчетныйДоход КАК МинимальныйРасчетныйДоход,
		|	УчетнаяПолитикаПоПерсоналуСрезПоследних.ДоплатаПНЗаСчетФирмы КАК ДоплатаПНЗаСчетФирмы,
		|	УчетнаяПолитикаПоПерсоналуСрезПоследних.СчетУчетаРасходовПоДоплатеПН КАК СчетУчетаРасходовПоДоплатеПН,
		|	УчетнаяПолитикаПоПерсоналуСрезПоследних.СтатьяПоДоплатеПН КАК СтатьяПоДоплатеПН,
		|	УчетнаяПолитикаПоПерсоналуСрезПоследних.СчетУчетаРасчетовПФФ КАК СчетУчетаРасчетовПФФ,
		|	УчетнаяПолитикаПоПерсоналуСрезПоследних.СчетУчетаРасчетовМСФ КАК СчетУчетаРасчетовМСФ,
		|	УчетнаяПолитикаПоПерсоналуСрезПоследних.СчетУчетаРасчетовФОТФ КАК СчетУчетаРасчетовФОТФ,
		|	УчетнаяПолитикаПоПерсоналуСрезПоследних.СчетУчетаРасчетовПФР КАК СчетУчетаРасчетовПФР,
		|	УчетнаяПолитикаПоПерсоналуСрезПоследних.СчетУчетаРасчетовГНПФР КАК СчетУчетаРасчетовГНПФР,
		|	УчетнаяПолитикаПоПерсоналуСрезПоследних.СреднемесячнаяЗПСФ КАК СреднемесячнаяЗПСФ,
		|	УчетнаяПолитикаПоПерсоналуСрезПоследних.ПроцентОтСЗПСФ КАК ПроцентОтСЗПСФ,
		|	УчетнаяПолитикаПоПерсоналуСрезПоследних.СчетУчетаРасходовПоКорректировкеСФ КАК СчетУчетаРасходовПоКорректировкеСФ,
		|	УчетнаяПолитикаПоПерсоналуСрезПоследних.СтатьяПоКорректировкеСФ КАК СтатьяПоКорректировкеСФ,
		|	УчетнаяПолитикаПоПерсоналуСрезПоследних.КоличествоСотрудниковДляОтчетаСФ КАК КоличествоСотрудниковДляОтчетаСФ,
		|	УчетнаяПолитикаПоПерсоналуСрезПоследних.СтавкаПрофВзнос КАК СтавкаПрофВзнос,
		|	УчетнаяПолитикаПоПерсоналуСрезПоследних.СчетУчетаРасчетовПрофВзнос КАК СчетУчетаРасчетовПрофВзнос,
		|	УчетнаяПолитикаПоПерсоналуСрезПоследних.ПрофВзносЗаВычетомПН КАК ПрофВзносЗаВычетомПН,
		|	УчетнаяПолитикаПоПерсоналуСрезПоследних.ПрофВзносЗаВычетомПФРиГНПФР КАК ПрофВзносЗаВычетомПФРиГНПФР,
		|	УчетнаяПолитикаПоПерсоналуСрезПоследних.РасчетПНБезНакопления КАК РасчетПНБезНакопления
		|ИЗ
		|	РегистрСведений.УчетнаяПолитикаПоПерсоналу.СрезПоследних(, Организация = &Организация) КАК УчетнаяПолитикаПоПерсоналуСрезПоследних";	
	Запрос.УстановитьПараметр("Организация", ОсновнаяОрганизация);	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЗаполнитьИВывестиОбластьМакета(ОбластьПодраздел, ДанныеПечати, "НаименованиеПодраздела", 
									НСтр("ru = 'Учетная политика по персоналу'"), ТабличныйДокумент);
									
	ПределыПоПодразделениям = Ложь;									
									
	Если Выборка.Следующий() Тогда
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Период: %1'"), Формат(Выборка.Период, "ДЛФ=D")), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Организация: %1'"), Выборка.Организация), ТабличныйДокумент);	
						
		ЗаполнитьИВывестиОбластьМакета(?(Выборка.ПределыПоПодразделениям, ОбластьНастройкаБулевоЗаполненная, ОбластьНастройкаБулевоПустая), ДанныеПечати, 
			"НаименованиеНастройки", НСтр("ru = 'Пределы по подразделениям'"), ТабличныйДокумент);
		
		ЗаполнитьИВывестиОбластьМакета(?(Выборка.ВозвратОтрицательнойСуммой, ОбластьНастройкаБулевоЗаполненная, ОбластьНастройкаБулевоПустая), ДанныеПечати, 
			"НаименованиеНастройки", НСтр("ru = 'Возврат ЗП отрицательной суммой'"), ТабличныйДокумент);
		
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Дата ограничения начисления ГНПФ (мужчины): %1'"), Формат(Выборка.ДатаОграниченияНачисленияГНПФМужчины, "ДЛФ=D")), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Дата ограничения начисления ГНПФ (женщины): %1'"), Формат(Выборка.ДатаОграниченияНачисленияГНПФЖенщины, "ДЛФ=D")), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Минимальный расчетный доход (МРД): %1'"), Выборка.МинимальныйРасчетныйДоход), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(?(Выборка.ДоплатаПНЗаСчетФирмы, ОбластьНастройкаБулевоЗаполненная, ОбластьНастройкаБулевоПустая), ДанныеПечати, 
			"НаименованиеНастройки", НСтр("ru = 'Доплата ПН за счет фирмы'"), ТабличныйДокумент);	
		
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Счет учета расходов по доплате ПН: %1'"), Выборка.СчетУчетаРасходовПоДоплатеПН), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Статья по доплате ПН: %1'"), Выборка.СтатьяПоДоплатеПН), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Счет учета расчетов ПФФ: %1'"), Выборка.СчетУчетаРасчетовПФФ), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Счет учета расчетов МСФ: %1'"), Выборка.СчетУчетаРасчетовМСФ), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Счет учета расчетов ФОТФ: %1'"), Выборка.СчетУчетаРасчетовФОТФ), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Счет учета расчетов ПФР: %1'"), Выборка.СчетУчетаРасчетовПФР), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Счет учета расчетов ГНПФР: %1'"), Выборка.СчетУчетаРасчетовГНПФР), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Среднемесячная заработная плата (СФ): %1'"), Выборка.СреднемесячнаяЗПСФ), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Среднемесячная заработная плата (СФ) (процент): %1'"), Выборка.ПроцентОтСЗПСФ), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Счет учета расходов по корректировке (СФ): %1'"), Выборка.СчетУчетаРасходовПоКорректировкеСФ), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Статья по корректировке (СФ): %1'"), Выборка.СтатьяПоКорректировкеСФ), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Количество сотрудников для отчета (СФ): %1'"), Выборка.КоличествоСотрудниковДляОтчетаСФ), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Ставка корп. отчислений: %1'"), Выборка.СтавкаПрофВзнос), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Счет учета расчетов (Проф. взнос): %1'"), Выборка.СчетУчетаРасчетовПрофВзнос), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(?(Выборка.ПрофВзносЗаВычетомПН, ОбластьНастройкаБулевоЗаполненная, ОбластьНастройкаБулевоПустая), ДанныеПечати, 
			"НаименованиеНастройки", НСтр("ru = 'Проф.взнос за вычетом ПН'"), ТабличныйДокумент);
		
		ЗаполнитьИВывестиОбластьМакета(?(Выборка.ПрофВзносЗаВычетомПФРиГНПФР, ОбластьНастройкаБулевоЗаполненная, ОбластьНастройкаБулевоПустая), ДанныеПечати, 
			"НаименованиеНастройки", НСтр("ru = 'Проф.взнос за вычетом ПФР и ГНПФР'"), ТабличныйДокумент);
			
		ЗаполнитьИВывестиОбластьМакета(?(Выборка.РасчетПНБезНакопления, ОбластьНастройкаБулевоЗаполненная, ОбластьНастройкаБулевоПустая), ДанныеПечати, 
			"НаименованиеНастройки", НСтр("ru = 'Расчет ПН без накопления'"), ТабличныйДокумент);
		
		ПределыПоПодразделениям = Выборка.ПределыПоПодразделениям;
	КонецЕсли;
	
	Если ПределыПоПодразделениям Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПределыПоПодразделениям.Период КАК Период,
			|	ПределыПоПодразделениям.Организация КАК Организация,
			|	ПределыПоПодразделениям.Подразделение КАК Подразделение,
			|	ПределыПоПодразделениям.МинимальныйРасчетныйДоход КАК МинРасчетныйДоход,
			|	ПределыПоПодразделениям.СреднемесячнаяЗПСФ КАК СреднемесЗП,
			|	ПределыПоПодразделениям.ОтделениеСФ КАК ОтделениеСФ,
			|	ПределыПоПодразделениям.УГНС КАК УГНС
			|ИЗ
			|	РегистрСведений.ПределыПоПодразделениям КАК ПределыПоПодразделениям
			|ГДЕ
			|	ПределыПоПодразделениям.Организация = &Организация";
		Запрос.УстановитьПараметр("Организация", ОсновнаяОрганизация);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыПределы");									
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		Пока Выборка.Следующий() Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаблицыПределы");
			ОбластьМакета.Параметры.Заполнить(Выборка);
			ТабличныйДокумент.Вывести(ОбластьМакета);	
		КонецЦикла;
	КонецЕсли;	
	// КОНЕЦ Раздел "Зарплата и персонал".
	
	ТабличныйДокумент.Вывести(ПустаяОбласть);
	
	// Раздел "Запаса".
	ЗаполнитьИВывестиОбластьМакета(ОбластьРаздел, ДанныеПечати, "НаименованиеРаздела", 
									НСтр("ru = 'Запасы'"), ТабличныйДокумент);
									
	ЗаполнитьИВывестиОбластьМакета(
		?(Константы.КонтролироватьОстаткиПриПроведении.Получить(), ОбластьНастройкаБулевоЗаполненная, ОбластьНастройкаБулевоПустая), 
		ДанныеПечати, "НаименованиеНастройки", НСтр("ru = 'Контролировать остатки при проведении'"), ТабличныйДокумент);
		
	СкладскойУчет = ОбщегоНазначенияБПСервер.ОпределитьПараметрыУчета().СкладскойУчет;	
		
	ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Настройка учета по складам (складской учет): %1'"), 
			?(СкладскойУчет = 1, НСтр("ru = 'по количеству'"), НСтр("ru = 'по количеству и сумме'"))), 
			ТабличныйДокумент);	
	// КОНЕЦ Раздел "Запаса".
	
	ТабличныйДокумент.Вывести(ПустаяОбласть);
	
	// Раздел "Покупака и продажа".
	ЗаполнитьИВывестиОбластьМакета(ОбластьРаздел, ДанныеПечати, "НаименованиеРаздела", 
									НСтр("ru = 'Покупака и продажа'"), ТабличныйДокумент);
									
	ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Настройка учета по складам (складской учет): %1'"), 
			Константы.СрокОплатыПокупателей.Получить()), 
			ТабличныйДокумент);
			
	ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Настройка учета по складам (складской учет): %1'"), 
			Константы.СрокОплатыПоставщикам.Получить()), 
			ТабличныйДокумент);		
									
	ЗаполнитьИВывестиОбластьМакета(
		?(Константы.ПечататьСчетаФактурыСГоловнымКонтрагентом.Получить(), ОбластьНастройкаБулевоЗаполненная, ОбластьНастройкаБулевоПустая), 
		ДанныеПечати, "НаименованиеНастройки", НСтр("ru = 'Печатать счета фактуры с головным контрагентом'"), ТабличныйДокумент);	
	// КОНЕЦ Раздел "Покупака и продажа".
	
	ТабличныйДокумент.Вывести(ПустаяОбласть);
	
	// Раздел "Производство".
	ЗаполнитьИВывестиОбластьМакета(ОбластьРаздел, ДанныеПечати, "НаименованиеРаздела", 
									НСтр("ru = 'Производство'"), ТабличныйДокумент);
									
	ЗаполнитьИВывестиОбластьМакета(ОбластьПодраздел, ДанныеПечати, "НаименованиеПодраздела", 
									НСтр("ru = 'Настройка учета производства'"), ТабличныйДокумент);
									
	ЗаполнитьИВывестиОбластьМакета(
		?(Константы.ФункциональнаяОпцияУчетПроизводстваПоЗаказам.Получить(), ОбластьНастройкаБулевоЗаполненная, ОбластьНастройкаБулевоПустая), 
		ДанныеПечати, "НаименованиеНастройки", НСтр("ru = 'Учет производства по заказам'"), ТабличныйДокумент);
		
	ЗаполнитьИВывестиОбластьМакета(
		?(Константы.ФункциональнаяОпцияУчетПроизводстваПоНоменклатурнымГруппам.Получить(), ОбластьНастройкаБулевоЗаполненная, ОбластьНастройкаБулевоПустая), 
		ДанныеПечати, "НаименованиеНастройки", НСтр("ru = 'Учет производства по номенклатурным группам'"), ТабличныйДокумент);
		
	ЗаполнитьИВывестиОбластьМакета(
		?(Константы.ИспользоватьНесколькоНоменклатурныхГрупп.Получить(), ОбластьНастройкаБулевоЗаполненная, ОбластьНастройкаБулевоПустая), 
		ДанныеПечати, "НаименованиеНастройки", НСтр("ru = 'Использовать несколько номенклатурных групп'"), ТабличныйДокумент);
		
	ЗаполнитьИВывестиОбластьМакета(
		?(Константы.РаспределятьРасходыСобственныхПодразделений.Получить(), ОбластьНастройкаБулевоЗаполненная, ОбластьНастройкаБулевоПустая), 
		ДанныеПечати, "НаименованиеНастройки", НСтр("ru = 'Распределять расходы собственных подразделений'"), ТабличныйДокумент);
		
	ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'База распределения корректировки себестоимости: %1'"), 
			Константы.БазаРаспределенияКорректировкиСебестоимости.Получить()), 
			ТабличныйДокумент);	
																		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МетодыРаспределенияКосвенныхРасходовОрганизаций.Период КАК Период,
		|	МетодыРаспределенияКосвенныхРасходовОрганизаций.Организация КАК Организация,
		|	МетодыРаспределенияКосвенныхРасходовОрганизаций.СчетЗатрат КАК СчетЗатрат,
		|	МетодыРаспределенияКосвенныхРасходовОрганизаций.Подразделение КАК Подразделение,
		|	МетодыРаспределенияКосвенныхРасходовОрганизаций.БазаРаспределения КАК БазаРаспределения
		|ИЗ
		|	РегистрСведений.МетодыРаспределенияКосвенныхРасходовОрганизаций КАК МетодыРаспределенияКосвенныхРасходовОрганизаций
		|ГДЕ
		|	МетодыРаспределенияКосвенныхРасходовОрганизаций.Организация = &Организация";	
	Запрос.УстановитьПараметр("Организация", ОсновнаяОрганизация);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() <> 0 Тогда
		ТабличныйДокумент.Вывести(ПустаяОбласть);
		ЗаполнитьИВывестиОбластьМакета(ОбластьПодраздел, ДанныеПечати, "НаименованиеПодраздела", 
										НСтр("ru = 'Методы распределения косвенных расходов'"), ТабличныйДокумент);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицыПределы");									
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		Пока Выборка.Следующий() Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаблицыПределы");
			ОбластьМакета.Параметры.Заполнить(Выборка);
			ТабличныйДокумент.Вывести(ОбластьМакета);	
		КонецЦикла;	
	КонецЕсли;	
	// КОНЕЦ Раздел "Производство".
	
	ТабличныйДокумент.Вывести(ПустаяОбласть);
	
	// Раздел "Доходы и расходы".
	ЗаполнитьИВывестиОбластьМакета(ОбластьРаздел, ДанныеПечати, "НаименованиеРаздела", 
									НСтр("ru = 'Доходы и расходы'"), ТабличныйДокумент);    
									
	ЗаполнитьИВывестиОбластьМакета(
		?(Константы.ФункциональнаяОпцияДопРасходыНаНесколькоПоступлений.Получить(), ОбластьНастройкаБулевоЗаполненная, ОбластьНастройкаБулевоПустая), 
		ДанныеПечати, "НаименованиеНастройки", НСтр("ru = 'Доп. расходы на несколько поступлений'"), ТабличныйДокумент);									
	// КОНЕЦ Раздел "Доходы и расходы".
	
	ТабличныйДокумент.Вывести(ПустаяОбласть);
	
	// Раздел "Прочее".
	ЗаполнитьИВывестиОбластьМакета(ОбластьРаздел, ДанныеПечати, "НаименованиеРаздела", 
									НСтр("ru = 'Прочее'"), ТабличныйДокумент);    
									
	ЗаполнитьИВывестиОбластьМакета(ОбластьНастройкаПроизвольногоТипа, ДанныеПечати, "НаименованиеНастройки",
			СтрШаблон(НСтр("ru = 'Макет оформления отчетов: %1'"), 
			Константы.МакетОформленияОтчетов.Получить()), 
			ТабличныйДокумент);
		
	ЗаполнитьИВывестиОбластьМакета(
		?(Константы.ФункциональнаяОпцияИспользоватьПодключаемоеОборудование.Получить(), ОбластьНастройкаБулевоЗаполненная, ОбластьНастройкаБулевоПустая), 
		ДанныеПечати, "НаименованиеНастройки", НСтр("ru = 'Использовать подключаемое оборудование'"), ТабличныйДокумент);
		
	ЗаполнитьИВывестиОбластьМакета(
		?(Константы.ФункциональнаяОпцияПрефиксКассыИБанковскогоСчета.Получить(), ОбластьНастройкаБулевоЗаполненная, ОбластьНастройкаБулевоПустая), 
		ДанныеПечати, "НаименованиеНастройки", НСтр("ru = 'Использовать префикс для кассы и банковского счета'"), ТабличныйДокумент);	
	// КОНЕЦ Раздел "Прочее".
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИВывестиОбластьМакета(Область, ДанныеПечати, ИмяПоля, ЗначениеЗаполнения, ТабличныйДокумент)

	ДанныеПечати[ИмяПоля] = ЗначениеЗаполнения;
	Область.Параметры.Заполнить(ДанныеПечати);	
	ТабличныйДокумент.Вывести(Область);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьНастройкиПоказыватьПриОткрытииПрограммы(ПоказыватьПриОткрытииПрограммы)
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ПечатьПараметровУчета", "Показывать", ПоказыватьПриОткрытииПрограммы);
	
КонецПроцедуры

#КонецОбласти
